In [3]:
import pandas as pd

### CREATION ###

In [ ]:
# OWN DATA 
data = {"name" : ["Alice","Bob","Charlie"],
        "age" : [25,32,28],
        "salary" : [40000,38000,20000]}
df = pd.DataFrame(data)
print (df)

      name  age  salary
0    Alice   25   40000
1      Bob   32   38000
2  Charlie   28   20000

In [4]:
# CSV FILE 
a = pd.read_csv("C:/Users/user/Desktop/PIAIC/practice/sample.csv")
print (a)

      Name  Age  Gender Occupation
0    Alice   25  Female   Engineer
1      Bob   30    Male     Doctor
2  Charlie   28    Male    Teacher
3    Diana   22  Female   Designer
4    Ethan   35    Male    Manager

In [6]:
#  EXCEL FILE 
b = pd.read_excel("sample_data.xlsx")
print (b)

      Name  Age                Email    Country
0    Alice   25    alice@example.com        USA
1      Bob   30      bob@example.com         UK
2  Charlie   22  charlie@example.com     Canada
3    David   35    david@example.com    Germany
4     Emma   28     emma@example.com  Australia

### EXPLORING ###

In [3]:
# TO GET COMPLETE DATA
b = pd.read_excel("sample_data.xlsx")
print (b)

      Name  Age                Email    Country
0    Alice   25    alice@example.com        USA
1      Bob   30      bob@example.com         UK
2  Charlie   22  charlie@example.com     Canada
3    David   35    david@example.com    Germany
4     Emma   28     emma@example.com  Australia

In [ ]:
# TO GET STRATING LINES DATA

b = pd.read_excel("sample_data.xlsx")
print (b.head(2))
print (b.head()) # DEFAULT VALUE == 5

    Name  Age              Email Country
0  Alice   25  alice@example.com     USA
1    Bob   30    bob@example.com      UK
      Name  Age                Email    Country
0    Alice   25    alice@example.com        USA
1      Bob   30      bob@example.com         UK
2  Charlie   22  charlie@example.com     Canada
3    David   35    david@example.com    Germany
4     Emma   28     emma@example.com  Australia

In [6]:
# TO GET ENDING LINES DATA
b = pd.read_excel("sample_data.xlsx")
print (b.tail(3))
print (b.tail())

      Name  Age                Email    Country
2  Charlie   22  charlie@example.com     Canada
3    David   35    david@example.com    Germany
4     Emma   28     emma@example.com  Australia
      Name  Age                Email    Country
0    Alice   25    alice@example.com        USA
1      Bob   30      bob@example.com         UK
2  Charlie   22  charlie@example.com     Canada
3    David   35    david@example.com    Germany
4     Emma   28     emma@example.com  Australia

In [ ]:
#  TO GET COMPLETE INFORMATION OF DATA
d = pd.read_excel("C:/Users/user/Downloads/random_data.xlsx")
print (d.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column 1  47 non-null     float64
 1   Column 2  39 non-null     float64
 2   Column 3  44 non-null     float64
 3   Column 4  44 non-null     float64
 4   Column 5  41 non-null     float64
 5   Column 6  38 non-null     float64
dtypes: float64(6)
memory usage: 2.5 KB
None

In [ ]:
# TO GET AGGREGATE AND STATISTICAL INFORMATION
d = pd.read_excel("C:/Users/user/Downloads/random_data.xlsx")
print (d.describe())

        Column 1   Column 2   Column 3   Column 4   Column 5   Column 6
count  47.000000  39.000000  44.000000  44.000000  41.000000  38.000000
mean   54.829787  42.564103  46.590909  49.272727  48.243902  51.157895
std    28.635884  30.362542  29.008674  29.248227  28.997224  24.914477
min     2.000000   1.000000   2.000000   1.000000   4.000000  11.000000
25%    28.500000  17.000000  20.250000  23.750000  22.000000  29.750000
50%    55.000000  41.000000  42.500000  51.000000  45.000000  51.500000
75%    80.500000  71.000000  68.250000  75.250000  72.000000  67.500000
max    99.000000  98.000000  94.000000  99.000000  97.000000  99.000000

In [12]:
#  TO GET NULL VALUE IN BOOLEAN FORM
d = pd.read_excel("C:/Users/user/Downloads/random_data.xlsx")
#print (d.isnull())
# TO GET COUNT OF A NULL VALUE 
print (d.isnull().sum())

Column 1     3
Column 2    11
Column 3     6
Column 4     6
Column 5     9
Column 6    12
dtype: int64

### HANDLING DUPLICATES ###

In [ ]:
# TO CHECK DUPLICATE IN A ROW
e = pd.read_excel("C:/Users/user/Downloads/employee_data.xlsx")
print (e.duplicated())
# TO CHECK DUPLICATE IN A COLUMN
print (e["Employee ID"].duplicated())
print (e["Employee ID"].duplicated().sum())
# TO DROP DUPLICATE BY COLUMNS
f = e.drop_duplicates("Employee ID")
g = e.drop_duplicates("Name")
h = e.drop_duplicates("Department")
print (f)
print (g)
print (h)

   Employee ID     Name   Age       Department  Salary Joining Date
0        E1000   Bisma   23.0               IT   55786   2020-06-15
1        E1001   Hannah  42.0        Marketing  108263   2021-03-09
2        E1002    Alice  25.0               IT   61941   2023-12-13
3        E1003      Bob  51.0               IT   45941   2021-03-09
4        E1004   Hannah  45.0       Operations   63249   2023-01-12
5        E1005  Charlie  27.0               IT   46847   2023-04-28
6        E1006    Grace  41.0               HR   57358   2022-09-11
7        E1007  Charlie  32.0        Marketing   65279   2022-07-12
8        E1008  Charlie  50.0               IT   96007   2023-01-27
9        E1009      Bob  54.0        Marketing   35673   2020-01-22
10       E1010      Bob  41.0              NaN  115441   2021-09-12
11       E1011      Eve  49.0               IT   34889   2020-07-17
13       E1013      Bob  55.0               HR   39081   2021-03-21
14       E1014    Alice  24.0               IT   72071   2020-12-10
15       E1015    Frank  56.0        Marketing   63226   2020-12-10
16       E1016    Frank  38.0  Adiministration  103651   2022-07-22
17       E1017  Charlie  52.0               IT   68690   2023-01-14
18       E1018      Eve  53.0               IT  111505   2020-07-07
19       E1019      Bob  38.0               IT   33774   2021-11-23
20       E1020      Bob  26.0  Adiministration   55642   2023-01-14
21       E1021   Hannah  54.0               IT   98207   2022-08-03
22       E1023      Bob  54.0               HR   99275   2023-01-14
24       E1024   Hannah  48.0          Finance   75888   2020-02-03
25       E1025    Grace  54.0               HR  110203   2021-07-26
26       E1026      Eve   NaN       Operations  104078   2020-12-10
27       E1027   Hannah  53.0               IT   55676   2022-07-28
28       E1028    David  31.0       Operations   96392   2020-02-01
29       E1029  Charlie  22.0               IT   96392   2023-02-28
   Employee ID     Name   Age Department  Salary Joining Date
0        E1000   Bisma   23.0         IT   55786   2020-06-15
1        E1001   Hannah  42.0  Marketing  108263   2021-03-09
2        E1002    Alice  25.0         IT   61941   2023-12-13
3        E1003      Bob  51.0         IT   45941   2021-03-09
5        E1005  Charlie  27.0         IT   46847   2023-04-28
6        E1006    Grace  41.0         HR   57358   2022-09-11
11       E1011      Eve  49.0         IT   34889   2020-07-17
15       E1015    Frank  56.0  Marketing   63226   2020-12-10
23       E1023    David  52.0         HR   64378   2023-02-12
   Employee ID    Name   Age       Department  Salary Joining Date
0        E1000  Bisma   23.0               IT   55786   2020-06-15
1        E1001  Hannah  42.0        Marketing  108263   2021-03-09
4        E1004  Hannah  45.0       Operations   63249   2023-01-12
6        E1006   Grace  41.0               HR   57358   2022-09-11
10       E1010     Bob  41.0              NaN  115441   2021-09-12
16       E1016   Frank  38.0  Adiministration  103651   2022-07-22
24       E1024  Hannah  48.0          Finance   75888   2020-02-03

### WORKING WITH MISSING DATA ###

In [4]:
a = pd.read_excel("C:/Users/user/Downloads/employee_data.xlsx")
#print (a.isnull()) # TO GET NULL VALUE IN BOOLEAN FORM
print (a.isnull().sum()) # TO GET COUNT OF A NULL VALUE

Employee ID     1
Name            3
Age             4
Department      3
Salary          4
Joining Date    4
dtype: int64

In [ ]:
# REPLACE NULL VALUE WITH A SPECIFIC VALUE
import numpy as np
a["Age"] = a["Age"].replace(np.nan,42)
print (a)
print (a["Salary"].mean())
a["Salary"] = a["Salary"].replace(np.nan,74318)
print (a)
print (a["Salary"].mean())

   Employee ID     Name   Age       Department    Salary Joining Date
0        E1000   Bisma   23.0               IT   55786.0   2020-06-15
1        E1001      NaN  42.0        Marketing  108263.0   2021-03-09
2        E1002    Alice  42.0               IT   61941.0   2023-12-13
3        E1003      Bob  51.0               IT   74318.0          NaT
4        E1004   Hannah  45.0       Operations   63249.0   2023-01-12
5        E1005  Charlie  27.0               IT   74318.0   2023-04-28
6        E1006    Grace  41.0               HR   57358.0   2022-09-11
7        E1007  Charlie  32.0        Marketing   65279.0   2022-07-12
8        E1008  Charlie  50.0               IT   96007.0   2023-01-27
9        E1009      NaN  54.0        Marketing   35673.0          NaT
10       E1010      Bob  42.0              NaN  115441.0   2021-09-12
11       E1011      Eve  49.0               IT   34889.0   2020-07-17
12         NaN    Alice  26.0       Operations   66115.0   2023-05-02
13       E1013      Bob  55.0               HR   39081.0   2021-03-21
14       E1014    Alice  24.0               IT   72071.0   2020-12-10
15       E1015    Frank  56.0        Marketing   63226.0   2020-12-10
16       E1016    Frank  38.0  Adiministration  103651.0   2022-07-22
17       E1017  Charlie  42.0              NaN   68690.0   2023-01-14
18       E1018      Eve  53.0              NaN   74318.0   2020-07-07
19       E1019      Bob  38.0               IT   33774.0   2021-11-23
20       E1020      Bob  26.0  Adiministration   55642.0   2023-01-14
21       E1021   Hannah  54.0               IT   98207.0          NaT
22       E1023      Bob  54.0               HR   99275.0   2023-01-14
23       E1023    David  52.0               HR   74318.0   2023-02-12
24       E1024   Hannah  48.0          Finance   75888.0   2020-02-03
25       E1025    Grace  54.0               HR  110203.0   2021-07-26
26       E1026      Eve  42.0       Operations  104078.0          NaT
27       E1027      NaN  53.0               IT   55676.0   2022-07-28
28       E1028    David  31.0       Operations   96392.0   2020-02-01
29       E1029  Charlie  22.0               IT   96392.0   2023-02-28
74317.3

In [ ]:
# REPLACING NULL VALUE WITH ABOVE OR BELOW VALUE
print (a.fillna(method = "ffill"))
print (a)

   Employee ID     Name   Age       Department    Salary Joining Date
0        E1000   Bisma   23.0               IT   55786.0   2020-06-15
1        E1001   Bisma   42.0        Marketing  108263.0   2021-03-09
2        E1002    Alice  42.0               IT   61941.0   2023-12-13
3        E1003      Bob  51.0               IT   74318.0   2023-12-13
4        E1004   Hannah  45.0       Operations   63249.0   2023-01-12
5        E1005  Charlie  27.0               IT   74318.0   2023-04-28
6        E1006    Grace  41.0               HR   57358.0   2022-09-11
7        E1007  Charlie  32.0        Marketing   65279.0   2022-07-12
8        E1008  Charlie  50.0               IT   96007.0   2023-01-27
9        E1009  Charlie  54.0        Marketing   35673.0   2023-01-27
10       E1010      Bob  42.0        Marketing  115441.0   2021-09-12
11       E1011      Eve  49.0               IT   34889.0   2020-07-17
12       E1011    Alice  26.0       Operations   66115.0   2023-05-02
13       E1013      Bob  55.0               HR   39081.0   2021-03-21
14       E1014    Alice  24.0               IT   72071.0   2020-12-10
15       E1015    Frank  56.0        Marketing   63226.0   2020-12-10
16       E1016    Frank  38.0  Adiministration  103651.0   2022-07-22
17       E1017  Charlie  42.0  Adiministration   68690.0   2023-01-14
18       E1018      Eve  53.0  Adiministration   74318.0   2020-07-07
19       E1019      Bob  38.0               IT   33774.0   2021-11-23
20       E1020      Bob  26.0  Adiministration   55642.0   2023-01-14
21       E1021   Hannah  54.0               IT   98207.0   2023-01-14
22       E1023      Bob  54.0               HR   99275.0   2023-01-14
23       E1023    David  52.0               HR   74318.0   2023-02-12
24       E1024   Hannah  48.0          Finance   75888.0   2020-02-03
25       E1025    Grace  54.0               HR  110203.0   2021-07-26
26       E1026      Eve  42.0       Operations  104078.0   2021-07-26
27       E1027      Eve  53.0               IT   55676.0   2022-07-28
28       E1028    David  31.0       Operations   96392.0   2020-02-01
29       E1029  Charlie  22.0               IT   96392.0   2023-02-28
   Employee ID     Name   Age       Department    Salary Joining Date
0        E1000   Bisma   23.0               IT   55786.0   2020-06-15
1        E1001      NaN  42.0        Marketing  108263.0   2021-03-09
2        E1002    Alice  42.0               IT   61941.0   2023-12-13
3        E1003      Bob  51.0               IT   74318.0          NaT
4        E1004   Hannah  45.0       Operations   63249.0   2023-01-12
5        E1005  Charlie  27.0               IT   74318.0   2023-04-28
6        E1006    Grace  41.0               HR   57358.0   2022-09-11
7        E1007  Charlie  32.0        Marketing   65279.0   2022-07-12
8        E1008  Charlie  50.0               IT   96007.0   2023-01-27
9        E1009      NaN  54.0        Marketing   35673.0          NaT
10       E1010      Bob  42.0              NaN  115441.0   2021-09-12
11       E1011      Eve  49.0               IT   34889.0   2020-07-17
12         NaN    Alice  26.0       Operations   66115.0   2023-05-02
13       E1013      Bob  55.0               HR   39081.0   2021-03-21
14       E1014    Alice  24.0               IT   72071.0   2020-12-10
15       E1015    Frank  56.0        Marketing   63226.0   2020-12-10
16       E1016    Frank  38.0  Adiministration  103651.0   2022-07-22
17       E1017  Charlie  42.0              NaN   68690.0   2023-01-14
18       E1018      Eve  53.0              NaN   74318.0   2020-07-07
19       E1019      Bob  38.0               IT   33774.0   2021-11-23
20       E1020      Bob  26.0  Adiministration   55642.0   2023-01-14
21       E1021   Hannah  54.0               IT   98207.0          NaT
22       E1023      Bob  54.0               HR   99275.0   2023-01-14
23       E1023    David  52.0               HR   74318.0   2023-02-12
24       E1024   Hannah  48.0          Finance   75888.0   2020-02-03
25       E1025    Grace  54.0               HR  110203.0   2021-07-26
26       E1026      Eve  42.0       Operations  104078.0          NaT
27       E1027      NaN  53.0               IT   55676.0   2022-07-28
28       E1028    David  31.0       Operations   96392.0   2020-02-01
29       E1029  Charlie  22.0               IT   96392.0   2023-02-28

C:\Users\user\AppData\Local\Temp\ipykernel_2492\232898415.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print (a.fillna(method = "ffill"))